Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMDA1_DFP/2.1.27/samda1b/svd/ATSAMDA1E14B.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>GCLK</name>
         <version>U21022.1.0</version>
         <description>Generic Clock Generator</description>
         <groupName>GCLK</groupName>
         <prependToName>GCLK_</prependToName>
         <baseAddress>0x40000C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRL</name>
               <description>Control</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SYNCBUSY</name>
                     <description>Synchronization Busy Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKCTRL</name>
               <description>Generic Clock Control</description>
               <addressOffset>0x2</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Generic Clock Selection ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <name>IDSelect</name>
                        <enumeratedValue>
                           <name>DFLL48</name>
                           <description>DFLL48</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FDPLL</name>
                           <description>FDPLL</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FDPLL32K</name>
                           <description>FDPLL32K</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WDT</name>
                           <description>WDT</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RTC</name>
                           <description>RTC</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EIC</name>
                           <description>EIC</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USB</name>
                           <description>USB</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_0</name>
                           <description>EVSYS_0</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_1</name>
                           <description>EVSYS_1</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_2</name>
                           <description>EVSYS_2</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_3</name>
                           <description>EVSYS_3</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_4</name>
                           <description>EVSYS_4</description>
                           <value>0xB</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_5</name>
                           <description>EVSYS_5</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_6</name>
                           <description>EVSYS_6</description>
                           <value>0xD</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_7</name>
                           <description>EVSYS_7</description>
                           <value>0xE</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_8</name>
                           <description>EVSYS_8</description>
                           <value>0xF</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_9</name>
                           <description>EVSYS_9</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_10</name>
                           <description>EVSYS_10</description>
                           <value>0x11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_11</name>
                           <description>EVSYS_11</description>
                           <value>0x12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOMX_SLOW</name>
                           <description>SERCOMX_SLOW</description>
                           <value>0x13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM0_CORE</name>
                           <description>SERCOM0_CORE</description>
                           <value>0x14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM1_CORE</name>
                           <description>SERCOM1_CORE</description>
                           <value>0x15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM2_CORE</name>
                           <description>SERCOM2_CORE</description>
                           <value>0x16</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM3_CORE</name>
                           <description>SERCOM3_CORE</description>
                           <value>0x17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM4_CORE</name>
                           <description>SERCOM4_CORE</description>
                           <value>0x18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM5_CORE</name>
                           <description>SERCOM5_CORE</description>
                           <value>0x19</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0_TCC1</name>
                           <description>TCC0_TCC1</description>
                           <value>0x1A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC2_TC3</name>
                           <description>TCC2_TC3</description>
                           <value>0x1B</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC4_TC5</name>
                           <description>TC4_TC5</description>
                           <value>0x1C</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC6_TC7</name>
                           <description>TC6_TC7</description>
                           <value>0x1D</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC</name>
                           <description>ADC</description>
                           <value>0x1E</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AC_DIG</name>
                           <description>AC_DIG</description>
                           <value>0x1F</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AC_ANA</name>
                           <description>AC_ANA</description>
                           <value>0x20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DAC</name>
                           <description>DAC</description>
                           <value>0x21</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I2S_0</name>
                           <description>I2S_0</description>
                           <value>0x23</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I2S_1</name>
                           <description>I2S_1</description>
                           <value>0x24</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GEN</name>
                     <description>Generic Clock Generator</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>GENSelect</name>
                        <enumeratedValue>
                           <name>GCLK0</name>
                           <description>Generic clock generator 0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK1</name>
                           <description>Generic clock generator 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK2</name>
                           <description>Generic clock generator 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK3</name>
                           <description>Generic clock generator 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK4</name>
                           <description>Generic clock generator 4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK5</name>
                           <description>Generic clock generator 5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK6</name>
                           <description>Generic clock generator 6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK7</name>
                           <description>Generic clock generator 7</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLK8</name>
                           <description>Generic clock generator 8</description>
                           <value>0x8</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKEN</name>
                     <description>Clock Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRTLOCK</name>
                     <description>Write Lock</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GENCTRL</name>
               <description>Generic Clock Generator Control</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Generic Clock Generator Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SRC</name>
                     <description>Source Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <name>SRCSelect</name>
                        <enumeratedValue>
                           <name>XOSC</name>
                           <description>XOSC oscillator output</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLKIN</name>
                           <description>Generator input pad</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCLKGEN1</name>
                           <description>Generic clock generator 1 output</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSCULP32K</name>
                           <description>OSCULP32K oscillator output</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSC32K</name>
                           <description>OSC32K oscillator output</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>XOSC32K</name>
                           <description>XOSC32K oscillator output</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OSC8M</name>
                           <description>OSC8M oscillator output</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DFLL48M</name>
                           <description>DFLL48M output</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DPLL96M</name>
                           <description>DPLL96M output</description>
                           <value>8</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GENEN</name>
                     <description>Generic Clock Generator Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDC</name>
                     <description>Improve Duty Cycle</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OOV</name>
                     <description>Output Off Value</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OE</name>
                     <description>Output Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIVSEL</name>
                     <description>Divide Selection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DIVSELSelect</name>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>Divide input directly by divider factor</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>Divide input by 2^(divider factor+ 1)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GENDIV</name>
               <description>Generic Clock Generator Division</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Generic Clock Generator Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DIV</name>
                     <description>Division Factor</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
