Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMDA1_DFP/2.1.27/samda1b/svd/ATSAMDA1E14B.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>NVIC</name>
         <description>Nested Vectored Interrupt Controller</description>
         <groupName>NVIC</groupName>
         <prependToName>NVIC_</prependToName>
         <baseAddress>0xE000E100</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x320</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>ISER</name>
               <description>Interrupt Set Enable Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SETENA</name>
                     <description>Interrupt set enable bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>29</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICER</name>
               <description>Interrupt Clear Enable Register</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLRENA</name>
                     <description>Interrupt clear-enable bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>29</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISPR</name>
               <description>Interrupt Set Pending Register</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SETPEND</name>
                     <description>Interrupt set-pending bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>29</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICPR</name>
               <description>Interrupt Clear Pending Register</description>
               <addressOffset>0x180</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLRPEND</name>
                     <description>Interrupt clear-pending bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>29</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>IPR[%s]</name>
               <description>Interrupt Priority Register n</description>
               <addressOffset>0x300</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PRI0</name>
                     <description>Priority of interrupt n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI1</name>
                     <description>Priority of interrupt n</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI2</name>
                     <description>Priority of interrupt n</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI3</name>
                     <description>Priority of interrupt n</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>SysTick</name>
         <description>System timer</description>
         <groupName>SysTick</groupName>
         <prependToName>SysTick_</prependToName>
         <baseAddress>0xE000E010</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CSR</name>
               <description>SysTick Control and Status Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x4</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>SysTick Counter Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ENABLESelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>Counter disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>Counter enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TICKINT</name>
                     <description>SysTick Exception Request Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TICKINTSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>Counting down to 0 does not assert the SysTick exception request</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>Counting down to 0 asserts the SysTick exception request</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKSOURCE</name>
                     <description>Clock Source 0=external, 1=processor</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CLKSOURCESelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>External clock</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>Processor clock</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>COUNTFLAG</name>
                     <description>Timer counted to 0 since last read of register</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RVR</name>
               <description>SysTick Reload Value Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RELOAD</name>
                     <description>Value to load into the SysTick Current Value Register when the counter reaches 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CVR</name>
               <description>SysTick Current Value Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CURRENT</name>
                     <description>Current value at the time the register is accessed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CALIB</name>
               <description>SysTick Calibration Value Register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>TENMS</name>
                     <description>Reload value to use for 10ms timing</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
                  <field>
                     <name>SKEW</name>
                     <description>TENMS is rounded from non-integer ratio</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SKEWSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>10ms calibration value is exact</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>10ms calibration value is inexact, because of the clock frequency</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOREF</name>
                     <description>No Separate Reference Clock</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>NOREFSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>The reference clock is provided</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>The reference clock is not provided</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
